// multiArrays.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main() //двумерые массивы
{
    int array[3][2] = { {5, 7}, {4, 3}, {9, 10} }; //все массивы должны быть одинаковой размерности
    std::cout << array[2][1] << "\n";

    std::cout << "----------------- \n";
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 2; j++) {
            std::cout <<" " << array[i][j];
        }
        std::cout << "\n";
    }
    std::cout << "----------------- \n";
    for (auto &arr : array) { //& - ссылка, необходимая для работы программы
        for (auto n : arr) {
            std::cout << n << " ";
        }
        std::cout << "\n";
    }

    std::cout << "Rederences \n"; // ссылки
    int x = 10;
    int& y = x; //обращение у к той же ячейке, равной 10, к которой обращается х. За счет этого они оба привязаны к 1 ячейке памяти.

    std::cout << y << "\n";
    x = 15;
    std::cout << y << "\n";
    y = 25;
    std::cout << x << "\n";


}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
